# Q1. ANS

In [1]:
import pandas as pd
import numpy as np
data=[4,8,15,16,23,42]

In [2]:
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. ANS

In [3]:
list=[10,12,13,14,15,17,16,22,76,78]

In [4]:
series_df=pd.Series(list)

In [5]:
series_df

0    10
1    12
2    13
3    14
4    15
5    17
6    16
7    22
8    76
9    78
dtype: int64

# Q3. ANS

In [6]:
data={
    'Name':['Alice','Bob','Claire'],
    'Age': [25,30,27],
    'Gender':['Female','Male','Female']
}

In [7]:
df=pd.DataFrame(data,columns=['Name','Age','Gender'])

In [8]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. ANS

In Pandas, a DataFrame is a two-dimensional, size-mutable, and tabular data structure that
is commonly used for data manipulation and analysis. It is essentially a collection of Pandas 
Series objects that share the same index, allowing you to work with structured data 
in a way that resembles a spreadsheet or a SQL table.
on the other hand,series is nothing  but it is single row or single column.

In [9]:
#exampes of series is.....
print()
print('this is the exapmle of pandas_series')
print()
series_df

this is the exapmle of pandas_series

0    10
1    12
2    13
3    14
4    15
5    17
6    16
7    22
8    76
9    78
dtype: int64

In [10]:
#example of DataFrame is...
print()
print('this is the example of DataFrame')
print()
df

this is the example of DataFrame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q5. ANS

# Important function in pandas DataFrame

1. value_counts()
2. sort_values()
3. rank()
5. sort_index()
6. set_index()
7. reset_index()
8. unique()
9. nunique()
10. isnull()
11. notnull()
12. hasnans()
13. dropna()
14. fillna()
15. drop_duplicates()
16. drop()

# value_counts()
applicable for both series and dataframe.it gives the frequency count of each unique item

In [11]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
df.value_counts()

Name    Age  Gender
Alice   25   Female    1
Bob     30   Male      1
Claire  27   Female    1
dtype: int64

# Q6. ANS

DataFrame is size mutable. we can add or remove columns from a DataFrame,
and you can also change the number of rows.

# Q7. ANS

In [13]:
import pandas as pd

# Creating multiple Series
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 35])
cities = pd.Series(['New York', 'Los Angeles', 'Chicago'])

# Creating a DataFrame from the Series
data = {'Name': names, 'Age': ages, 'City': cities}
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago